app/Controllers/AuthController.php

    public function login()
    {
        if ($this->request->is('post')) {
            $rules = [
                'email'    => 'required|valid_email',
                'password' => 'required'
            ];

            if (!$this->validate($rules)) {
                return redirect()->back()->withInput()->with('error', 'Invalid input.');
            }

            $userModel = new UserModel();
            $user = $userModel->where('email', $this->request->getPost('email'))->first();
---
SELECT *
FROM `users`
WHERE `email` = 'staff@smro.com'
 LIMIT 1